Revit 2027 API
WaterLoopData.ChillerType Property
 The type of water chiller. Note this property change would reset the condenser water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WaterChillerType ChillerType { get; set; }
Public Property ChillerType As WaterChillerType
	Get
	Set
public:
property WaterChillerType ChillerType {
	WaterChillerType get ();
	void set (WaterChillerType value);
}
member ChillerType : WaterChillerType with get, set
Property Value
WaterChillerType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace